<?php

return [
    'mails' => [
        'welcome' => [
            'subject' => 'ایمیل خوش آمدگویی',
            'title' => 'خوش آمدید!',
            'content' => 'به گروه بزرگ :title خوش آمدید.',
            'footer' => 'ممنون،',
            'link' => 'ورود به حساب کاربری',
        ],
        'forgot_password' => [
            'subject' => 'ایمیل فراموشی رمزعبور',
            'title' => 'کد فراموشی رمزعبور',
            'content' => 'کد تایید فراموشی رمزعبور: :title',
        ],
    ],
    'errors' => [
        'user_account_not_found' => 'حساب کاربری یافت نشد.',
        'unauthorized' => 'احراز هویت نشده.',
        'authenticated' => 'قبلا احراز هویت شده.',
        'current_password_incorrect' => 'رمزعبور فعلی اشتباه میباشد.',
        'user_has_already_password' => 'حساب کاربر مورد نظر دارای رمز عبور میباشد، برای تغییر رمزعبور از متد به `روزرسانی رمزعبور` استفاده کنید.',
        'access_denied' => 'مجوز لازم برای اینکار را ندارید.',
        'not_found' => 'صفحه پیدا نشد.',
        'wait_for_new_password_reset_token' => 'برای ارسال مجدد کد فراموشی رمزعبور لحظاتی دیگر تلاش کنید.',
        'password_reset_code_wrong' => 'کد تایید فراموشی رمزعبور اشتباه میباشد.',
        'password_reset_code_expired' => 'کد تایید فراموشی رمزعبور منقضی شده است. (  برای دریافت دوباره کد تایید مراحل فراموشی رمزعبور را از ابتدا شروع کنید. )',
    ],
];
